{
  "HomePage": {
    "subtitle": "Hello! I'm a Japanese frontend developer who enjoys music and web development!",
    "seeprojects": "See My Projects",
    "aboutme": "About Me"
  },
  "About": {
    "title": "About Me",
    "subtitle": "Hello! I'm a Japanese frontend developer who enjoys music and web development. Here, I'd like to share my past experiences and how my interest in earthquakes began.",
    "programming": {
      "title": "My Start in Programming",
      "content1": "When I was in 4th grade, I discovered programming through a platform called ",
      "content2": ". I learned the basics by creating games and apps there, which laid the foundation for my later projects, including earthquake-related development."
    },
    "webdesign": {
      "title": "My Challenge in Web Design",
      "content": "My curiosity about programming led me to start creating websites with HTML. Initially, my designs weren’t great, but by studying other sites for inspiration, I gradually honed my skills."
    },
    "earthquake": {
      "title": "Discovering Earthquakes",
      "content1": "My interest in earthquakes began with the Noto Peninsula Earthquake. That day, I was at my mother’s family home preparing dinner when the house suddenly shook violently, and emergency alerts blared. When I opened the emergency earthquake alert software,",
      "content2": ", it displayed \"Maximum intensity 7.\" This experience significantly deepened my fascination with earthquake observation."
    },
    "earthquaketool": {
      "title": "Developing Earthquake Information Tools",
      "content": "My first earthquake-related tool was \"EarthSaidBOT.\" While it had many shortcomings due to my inexperience in design and implementation, I have improved it over time by gaining more experience. Currently, I’m running a relay server that aggregates data from multiple sources, working to enhance the accuracy and stability of earthquake information delivery. This allows me to provide timely and reliable updates.",
      "note1": "Note: This is operated within the scope of personal use in compliance with ",
      "note2": "'s guidelines."
    },
    "music": {
      "title": "Beginning Music Production",
      "content1": "I got into music production as a hobby, and one day I was like, 'Man, I kinda wanna start my own label...' So, in 2025, I launched '",
      "content2": "' a participatory label. This really helped me level up my skills and know-how in music production and distribution."
    }
  },
  "Projects": {
    "title": "My Projects",
    "subtitle": "These are my works and their associated GitHub repositories. I’ve learned a lot from each of these projects.",
    "viewsite": "View Site"
  },
  "Favorites": {
    "title": "My Favorites",
    "subtitle": "My favorite music and games that I enjoy.",
    "music": "Music",
    "game": "Games"
  }
}